<template>
  <div class="">

    <div class=" bg-main-primary">
      <div class="container mx-auto px-4 lg:max-w-7xl lg:px-8">

        <div class="flex items-center h-20 justify-between">

          <div class="flex items-center gap-4"><span class="font-bold text-white text-[36px]">+150</span><p class="text-gray-100 text-sm">Сотрудников</p></div>
          <div class="flex items-center gap-4"><span class="font-bold text-white text-[36px]">+3500</span><p class="text-gray-100 text-sm">Реализованных проектов</p></div>
          <div class="flex items-center gap-4"><span class="font-bold text-white text-[36px]">+560 Га</span><p class="text-gray-100 text-sm">Площадь производства</p></div>
          <div class="flex items-center gap-4"><span class="font-bold text-white text-[36px]">+200</span><p class="text-gray-100 text-sm">Волнистых попугаев</p></div>

        </div>

      </div>
    </div>


    <div class="bg-white py-1">
      <div class="container mx-auto  lg:max-w-7xl lg:px-8">
        <p v-for="i in 15" :key="i" class="my-4">hallo welt</p>
      </div>      
    </div>


    <div class="">
      <div class="bg-white">

        <div class="bg-[url('images/rails-bg.jpg')] h-[480px] bg-no-repeat bg-left-bottom bg-cover">
          <div class="bg-main-primary/70 hover:bg-main-primary/80 backdrop-blur-sm transition-all duration-1000 h-full relative">
            <div class="absolute w-full h-full">

              <div class="container mx-auto px-4 lg:max-w-7xl lg:px-8 h-full">
                <div class="flex items-center justify-center h-full">
                  <div class="grid grid-cols-1 gap-2">
                    <p class="text-slate-200 font-black text-[36px] uppercase">Ищете надежное и эффективное решение для сварки рельсов?</p>
                    <p class="text-3xl text-white uppercase">У нас есть идеальное предложение для вас!</p>                
                  </div>
                </div>
              </div>

            </div>
          </div>
        </div>

      </div>
    </div>

    <div class="bg-white/80 py-4">
      <div class="container mx-auto px-4 lg:max-w-7xl lg:px-8">
        Обучение и техническая поддержка Мы предлагаем специализированное техническое обучение и консультации по электросварке рельсов. Наша команда состоит из опытных инженеров и квалифицированных рабочих, которые всегда готовы и рады поделиться своими знаниями с другими профессионалами в этой области. Сервисная служба компании Railwelding уделяет много внимания качественной передаче знаний, постоянному сопровождению и обеспечению устойчивого производства без необходимости частого технического обслуживания. Такой комплексный подход к клиентскому сервису является залогом долгосрочного плодотворного сотрудничества. Мы охотно обучим и проконсультируем вас по всем вопросам эксплуатации и обслуживания выпускаемого нами оборудования.
      </div>
    </div>

    <div class="bg-white/80 py-4">
      <div class="container mx-auto px-4 lg:max-w-7xl lg:px-8">

        <p class="">
          Обслуживание и устранение неполадок на месте
        </p>

        <p class="">
          Мы предлагаем сервисное обслуживание и устранение неполадок на месте для всего ассортимента продуктов и оборудования Railwelding.
        </p>
        
        <p class="">
          + Анализ ошибок и устранение неисправностей на месте
        </p>

        <p class="">
          + Ремонт или замена неисправных компонентов силами опытных технических специалистов
        </p>
        <p class="">
          + Документальная фиксация случаев возникновения неисправностей и описание способов устранения неисправностей (сервисные отчеты)
        </p>
        <p class="">
          + Рекомендации по предотвращению неисправностей
        </p>

        <p class="">
          Наши специалисты готовы оперативно вмешаться, чтобы работы можно было возобновить как можно скорее.
        </p>
          
      </div>
    </div>

    <div class="bg-white/80 py-4">
      <div class="container mx-auto px-4 lg:max-w-7xl lg:px-8">
        Капитальный ремонт оборудования Профессиональное и регулярное техническое обслуживание оборудования минимизирует внеплановые и дорогостоящие простои и обеспечивает необходимую производительность. Благодаря этому, также снижаются до необходимого минимума расходы на ремонт. Сервисные специалисты Railwelding имеют многолетний опыт разработки и ремонта рельсосварочных машин и комплектующего оборудования и регулярно осуществляют гарантийное и пост гарантийное обслуживание производимого оборудования в соответствии с действующими стандартами. Однако, если у вас возникнет необходимость в ремонте или модернизации (переоснащении) устаревшего или вышедшего из строя рельсосварочного оборудования, мы окажем вам быструю и надёжную помощь в этом. Благодаря наличию необходимого собственного оборудования, инструментов и комплектующих деталей, ваше оборудование быстро вернётся в строй. Мы готовы не только осуществить полное восстановление бывшего в эксплуатации оборудования, но и улучшить его технические характеристики, необходимые для введения вашей устаревшей рельсосварочной машины в современное производство. Мы дадим вашему оборудованию новую жизнь!
      </div>
    </div>


    
    <div class="bg-white/80 py-4">


      <div class="container mx-auto px-4 lg:max-w-7xl lg:px-8">

        <div class="flex items-center justify-center text-center">
          <div class="w-[850px]">
            КОМПАНИЯ RAILWELDING Лидер в разработке и производстве рельсосварочного оборудования. Наши инновационные технологии и высокое качество материалов обеспечивают надёжность и долговечность нашего оборудования. Наша компания предлагает широкий ассортимент рельсосварочных машин, разработанных и изготовленных полностью внутри компании с учетом особенностей каждого проекта и потребностей каждого клиента. В нашем каталоге вы найдете оборудование, доступное в различных конфигурациях. С нами вы можете быть уверены, что ваш процесс сварки рельсов будет проходить без задержек и неполадок!
          </div>
        </div>
      

      <div class="flex items-center justify-center py-4 px-10">
        <p class="text-slate-800 text-center">С нами вы можете быть уверены, что ваш процесс сварки рельсов будет проходить без задержек и неполадок!</p>
      </div>

      <div class="flex items-center justify-center py-10">
        <img src="logo.png" class=" h-8"/>
      </div>
      </div>
      
    </div>


  </div>

</template>